import hw_pyth02_2


def switch ():

    print("\n ==================== МЕНЮ ===================")
    print(" |                                           |\n \
|  1. [в стадии интеграции]                 |\n \
|  2. задача похожая на поиск факториала    | \n \
|  3. [в стадии интеграции]                 |\n \
|  4. [в стадии разработки]                 |\n \
|  5. [в стадии разработки]                 |\n \
|  0. Выход                                 |\n \
=============================================")
    try:
        case = int(input("Выберите пункт меню.\n"))
    except:
        print("Нет, вводить нужно целое число.\n")
        switch()
    if (case == 2):
        hw_pyth02_2.init()
        switch()
    elif (case == 0):
        print("Завершение работы программы")
        return
    else:
        print("Такого пункта меню пока нет(")
        switch()

try:
    switch()
except:
    print("Соррян, произошла непредвиденная ситуация.")

